//Requirements for project

//Book Company BOOKY
//Data company have and we need to create API on these:-

// Books
//-> ISBN : id, TITLE, Pulish date, Language, Pages, Authors[], Category[]


// Authors
//-> id, name, books[] 


//Publications
// -> id, name, books[]

//<--------------------- API --------------------->
//Api required:-

//--------->>>>  Book:- we need API for
//GET----------------------------------------------------------> 1
//to get all books  -------------------------------------------> ☑️ ❎
//to get specific book based on id ----------------------------> ☑️ ❎
//to get list of books based on category-----------------------> ☑️ ❎
//to get a book based on language -----------------------------> ☑️ ❎

//POST---------------------------------------------------------> 2
//to add(post) new book----------------------------------------> ☑️ ❎

//PUT----------------------------------------------------------> 3
//to update(put) book title------------------------------------> ☑️ ❎
//to update(put) book author-----------------------------------> ☑️ ❎🔥

//DELETE-------------------------------------------------------> 4
//to delete a book---------------------------------------------> ☑️ ❎
//to delete a book author--------------------------------------> ☑️🔥🔥 ❎🔥🔥



//--------->>>>  Authors:- we need an API
//GET ---------------------------------------------------------> 1
//to get all authors-------------------------------------------> ☑️ ❎
//to get specific authors--------------------------------------> ☑️ ❎
//to get list of authors based on books------------------------> ☑️

//POST---------------------------------------------------------> 2
//to add(post) new author--------------------------------------> ☑️ ❎

//PUT----------------------------------------------------------> 3
//to update(put) author name-----------------------------------> ☑️

//DELETE-------------------------------------------------------> 4
//to delete an author------------------------------------------> ☑️



//--------->>>>  Publications:- we need an API
//GET----------------------------------------------------------> 1
//to get all publication---------------------------------------> ☑️   
//to get specific publication----------------------------------> ☑️
//to get list of publication based on book---------------------> ☑️

//POST---------------------------------------------------------> 2
//to add new publication---------------------------------------> ☑️ ❎

//PUT----------------------------------------------------------> 3
//to update the publication name-------------------------------> ☑️
//to add books to publication--------------------------------->  ☑️ 🔥🔥

//DELETE-------------------------------------------------------> 4
//to delete a book from publication----------------------------> ☑️